Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/SUI_ДополнительныеНастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеНастройкиТаблицИнтеграции</name>
  <resources>
    <name>ДанныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыЦен</name>
  </enumValues>
  <enumValues>
    <name>ЦеныНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковокДокументов</name>
  </enumValues>
  <enumValues>
    <name>ДокументыАдресногоХранения</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДокументовАдресногоХранения</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>СерииДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить дополнительные настройки.
// 
// Параметры:
//  ТаблицаИнтеграции - ПеречислениеСсылка.SUI_ТаблицыИнтеграции, Неопределено - Таблица интеграции
// 
// Возвращаемое значение:
//  Соответствие - Дополнительные настройки таблицы интеграции
//@skip-check doc-comment-collection-item-type
Функция ПолучитьДополнительныеНастройки(ТаблицаИнтеграции = Неопределено) Экспорт
	
	ДополнительныеНастройки = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеНастройки.ТаблицаИнтеграции КАК ТаблицаИнтеграции,
		|	ДополнительныеНастройки.ДанныеНастройки КАК ДополнительныеНастройки
		|ИЗ
		|	РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции КАК ДополнительныеНастройки
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ТаблицаИнтеграции = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ДополнительныеНастройки.ТаблицаИнтеграции = &ТаблицаИнтеграции
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаИнтеграции", ТаблицаИнтеграции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДополнительныеНастройки.Вставить(Выборка.ТаблицаИнтеграции, Выборка.ДополнительныеНастройки.Получить());
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

// Сохранить дополнительные настройки.
// 
// Параметры:
//  ДополнительныеНастройки - Соответствие из ПеречислениеСсылка.SUI_ТаблицыИнтеграции - Дополнительные настройки таблиц интеграции
//  ПерезаписатьВсе - Булево - Удалить существующие настройки перед записью 
Процедура СохранитьДополнительныеНастройки(ДополнительныеНастройки, ПерезаписатьВсе = Ложь) Экспорт
	
	ТаблицаНастройки = Новый ТаблицаЗначений();
	ТаблицаНастройки.Колонки.Добавить("ТаблицаИнтеграции", Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции"));
	ТаблицаНастройки.Колонки.Добавить("ДанныеНастройки", Новый ОписаниеТипов("ХранилищеЗначения"));
	
	ТипыСоответствие = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Тип("Соответствие"), 
		Тип("ФиксированноеСоответствие"));
	
	ОписаниеТипаСоответствие = Новый ОписаниеТипов(ТипыСоответствие);
	
	Для Каждого ДополнительнаяНастройка Из ОписаниеТипаСоответствие.ПривестиЗначение(ДополнительныеНастройки) Цикл
		
		Если ТаблицыИнтеграцииДополнительныхНастроек().Найти(ДополнительнаяНастройка.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНастройки = ТаблицаНастройки.Добавить();
		СтрокаНастройки.ТаблицаИнтеграции = ДополнительнаяНастройка.Ключ;
		СтрокаНастройки.ДанныеНастройки = Новый ХранилищеЗначения(ДополнительнаяНастройка.Значение, Новый СжатиеДанных(9));
		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Если Не ПерезаписатьВсе Тогда
			ЭлементБлокировки.ИсточникДанных = ТаблицаНастройки;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТаблицаИнтеграции", "ТаблицаИнтеграции");
		КонецЕсли;
		Блокировка.Заблокировать();
		
		Если ПерезаписатьВсе Тогда
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(ТаблицаНастройки);
			НаборЗаписей.Записать(Истина);
			
		Иначе
			
			Для Каждого СтрокаТаблицы Из ТаблицаНастройки Цикл
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(СтрокаТаблицы.ТаблицаИнтеграции);
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТаблицыИнтеграцииДополнительныхНастроек() Экспорт
	
	Таблицы = Новый Массив();
	
	Таблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	Таблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	Таблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	Возврат Новый ФиксированныйМассив(Таблицы);
		
КонецФункции

#КонецОбласти

#КонецЕсли
